Revit 2024 API
BuiltInFailures.RegenFailures.CircularDependencyConstraintError Property
 Highlighted constraints cause a circular chain of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircularDependencyConstraintError { get; }
Visual Basic
Public Shared ReadOnly Property CircularDependencyConstraintError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircularDependencyConstraintError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace